/*说明走迷宫是递回求解的基本题型，在二维阵列中使用2表示迷宫墙壁，使用1来表示行走路径，试以程式求出由入口至出口的路径。
解法走法有上、左、下、右四个方向，在每前进一格之后就选一个方向前进，无法前进时退回选择下一个可前进方向，如此在阵列中依序测试四个方向，直到走到出口为止。*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>

int visit(int, int); 
//迷宫矩阵，'#'代表墙壁，' '代表通道
char maze[10][10] = { 
	'#', ' ', '#', '#', '#', '#', '#', '#', '#', '#',
	'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', '#',
	'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', '#',
	'#', ' ', ' ', ' ', ' ', '#', '#', ' ', ' ', '#',
	'#', ' ', '#', '#', '#', ' ', ' ', ' ', ' ', '#',
	'#', ' ', ' ', ' ', '#', ' ', '#', ' ', '#', '#',
	'#', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', '#',
	'#', ' ', '#', '#', '#', ' ', '#', '#', ' ', '#',
	'#', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
	'#', '#', '#', '#', '#', '#', '#', '#', '#', '#'
};

int startI = 1, startJ = 1;  // 入口
int endI = 8, endJ = 8;  // 出口
int success = 0;

int main(void) 
{ 
    int i, j;

    printf("显示迷宫：\n"); 
    for(i = 0; i < 10; i++)
 { 
        for(j = 0; j < 10; j++) 
  {
			if (maze[i][j] == '#')
                printf("█"); 
            else 
                printf("  "); 
        }
  printf("\n"); 
    }

    if(visit(startI, startJ) == 0)
 {
        printf("\n没有找到出口！\n"); 
    }
 else 
 { 
        printf("\n显示路径：\n"); 
        for(i = 0; i < 10; i++) 
  { 
            for(j = 0; j < 10; j++)
   { 
				if (maze[i][j] == '#')
                    printf("█"); 
				else if (maze[i][j] == '1')
                    printf("◇"); 
                else 
                    printf("  "); 
            } 
            printf("\n"); 
        } 
    }
	system("PAUSE");
    return 0; 
}

int visit(int i, int j) 
{ 
 //该点走过，标记为1
	maze[i][j] = '1';
 //走到终点，成功
    if(________________________)
        success = 1; 
 //向四个方向递归调用函数visit()
	if (success != 1 && maze[i][j + 1] == ' ') visit(i, j + 1);
	if (success != 1 && maze[i + 1][j] == ' ') visit(i + 1, j);
	if(________________________________) visit(_______); 
        if(________________________________) visit(_______);
 
 //该点走过，但没成功，则该点重新置为空
    if(success != 1) 
	__________________;
    
    return success; 
}  